In [1]:
import numpy as np 
import pandas as pd 


hotels_df = pd.read_csv('../data/hotels.csv')
hotels_df.shape

(40552, 8)

In [2]:
hotels_df.head()

,travelCode,userCode,name,place,days,price,total,date
0,0,0,Hotel A,Florianopolis (SC),4,313.02,1252.08,09/26/2019
1,2,0,Hotel K,Salvador (BH),2,263.41,526.82,10/10/2019
2,7,0,Hotel K,Salvador (BH),3,263.41,790.23,11/14/2019
3,11,0,Hotel K,Salvador (BH),4,263.41,1053.64,12/12/2019
4,13,0,Hotel A,Florianopolis (SC),1,313.02,313.02,12/26/2019

In [3]:
hotels_df.columns

Index(['travelCode', 'userCode', 'name', 'place', 'days', 'price', 'total',
       'date'],
      dtype='object')

In [4]:
hotels_df.isnull().sum()

travelCode    0
userCode      0
name          0
place         0
days          0
price         0
total         0
date          0
dtype: int64

In [5]:
interactions = (
    hotels_df.groupby(['userCode','name','place']).size().reset_index(name = 'interaction')   
)

interactions.head()

   userCode      name               place  interaction
0         0   Hotel A  Florianopolis (SC)            3
1         0  Hotel AF      Sao Paulo (SP)            4
2         0  Hotel AU         Recife (PE)            2
3         0  Hotel BD          Natal (RN)            4
4         0  Hotel BP       Brasilia (DF)            1

In [6]:
print("Users:", interactions['userCode'].nunique())
print("Hotels" , interactions['name'].nunique())
print("Interactions:", len(interactions))

Users: 1310
Hotels 9
Interactions: 9724

In [7]:
# Popular Hotels per place 

popular_by_place = (
    interactions.groupby(['place','name']).agg(total_interactions = ('interaction' , 'sum')).reset_index().sort_values(['place','total_interactions'] , ascending = [True , False])
)

popular_by_place.head(10)

                 place      name  total_interactions
0         Aracaju (SE)   Hotel Z                4205
1        Brasilia (DF)  Hotel BP                4437
2    Campo Grande (MS)  Hotel BW                4333
3   Florianopolis (SC)   Hotel A                3330
4           Natal (RN)  Hotel BD                4829
5          Recife (PE)  Hotel AU                4467
6  Rio de Janeiro (RJ)  Hotel CB                5029
7        Salvador (BH)   Hotel K                5094
8       Sao Paulo (SP)  Hotel AF                4828

In [21]:
all_places = popular_by_place['place'].nunique()
# Chose one place randomly
rand_place = popular_by_place['place'].sample(1).values[0]
print(f"Total Places: {all_places} , Random Place: {rand_place}")

Total Places: 9 , Random Place: Brasilia (DF)

In [22]:
# Recommend the best hotel for the random place using popular_by_place df 
popular_by_place.loc[popular_by_place['place'] == rand_place, 'name' ].values[0]

'Hotel BP'